---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamSource
source: html/42879cbb-dd18-9d4c-3911-0bbafd4b8b99.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamSource Property

"Source"

## Syntax (C#)
```csharp
public static ForgeTypeId MaterialAssetParamSource { get; }
```